namespace Domain.Entities.Enums
{
    public enum Specialties
    {
        القانون_الجنائي = 1,
        القانون_المدني = 2,
        قانون_الشركات = 3,
        قانون_الأحوال_الشخصية = 4,
        قانون_العمل = 5,
        القانون_العقاري = 6,
        قانون_الملكية_الفكرية = 7,
        القانون_الضريبي = 8,
        قانون_الهجرة = 9,
        القانون_البيئي = 10,
        قانون_العقود = 11,
        القانون_الدستوري = 12,
        القانون_الدولي = 13,
        قانون_البنوك_والتمويل = 14,
        قانون_الأخطاء_الطبية = 15,
        قانون_التعويضات = 16,
        القانون_الإداري = 17,
        قانون_الجرائم_الإلكترونية = 18,
        القانون_البحري = 19,
        قانون_الإعلام_والترفيه = 20
    }

}